## "Кратные пяти из диапазона"

### Задание

Даны два целые числа a и b.

Выведите на экран все целые **кратные 5** от a до b включительно.

### Формат входных данных

Даны два целые числа. **Не гарантируется**, что a < b. \
Если a > b, то выводим все числа из диапазона [b, a].

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
# Очень понравилось это решать)
a = int(input("a: "))
b = int(input("b: "))
sum = a + b
magic = 4  # Целое меньше 5
b = int((a + b + abs(a - b)) / 2)
a = (sum - b + magic) // 5 * 5
while a <= b:
    print(a)
    a += 5
```
