# По данному числу n закончите фразу «На лугу пасется...» одним из возможных продолжений:
# «n коров», «n корова», «n коровы», правильно склоняя слово «корова».
# Формат входных данных
# Дано целое положительное число n
# Формат выходных данных
# Программа должна вывести введенное число n и одно из слов (на латинице):
# коров, корова или коровы
# Например, 1 корова, 2 коровы, 5 коров, 125 коров.

count = int(input("n :"))
if count % 10 == 1:
    print(count, " корова")
elif 1 < count % 10 < 5:
    print(count, " коровы")
else:
    print(count, " коров")
