# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
s=", "
row=s.join(names)
print(row)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
